results/pgbenchResults_vbox_windows_centos_2gb.txt
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.263 ms
tps = 1210.209593 (including connections establishing)
tps = 1213.707875 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.718 ms
tps = 1147.071295 (including connections establishing)
tps = 1150.436918 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.562 ms
tps = 1167.932710 (including connections establishing)
tps = 1171.415731 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 8.610 ms
tps = 1161.391944 (including connections establishing)
tps = 1164.648470 (excluding connections establishing)
Starting new PGBench Test
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 334
query mode: simple
number of clients: 10
number of threads: 1
number of transactions per client: 100
number of transactions actually processed: 1000/1000
latency average = 9.329 ms
tps = 1071.930244 (including connections establishing)
tps = 1075.859254 (excluding connections establishing)